app/views/messages/index.html.erb

		<table class="comments">
			<% message.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = ?  [["message_id", 1]]