app/views/comments/_comment.html.erb

<% @message.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."message_id" = ?  [["message_id", 1]]