app/controllers/comments_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "doob"], ["body", "wack"], ["message_id", 1], ["created_at", "2015-06-27 02:28:48.648290"], ["updated_at", "2015-06-27 02:28:48.648290"]]
---
	def create
		@message = Message.find(params[:message_id])
		@comment = @message.comments.create(comment_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 3], ["id", 4]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
	def destroy
		@message = Message.find(params[:message_id])
		@comment = @message.comments.find(params[:id])
		@comment.destroy