app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@message = Message.find(params[:id])

INSERT INTO "messages" ("state", "plate_no", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["state", "CA"], ["plate_no", "123456"], ["message", "Yo yo yo"], ["created_at", "2015-06-25 04:49:39.295525"], ["updated_at", "2015-06-25 04:49:39.295525"]]
---
	def create
		# render plain: params[:message].inspect
		@message = Message.new(message_params)

		if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "messages" SET "message" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["message", "Yo yo yo No"], ["updated_at", "2015-06-27 01:10:22.791630"], ["id", 1]]
---
	def update
		@message = Message.find(params[:id])
		if @message.update(message_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 5]]
---
	def destroy
		@message = Message.find(params[:id])
		@message.destroy